package laba3;

public class Example5 {
    /*Напишите программу, в которой вычисляется сумма чисел,
    удовлетворяющих таким критериям: при делении числа на 5 в остатке
    получается 2, или при делении на 3 в остатке получается 1 Количество чисел
    в сумме вводится пользователем. Программа отображает числа, которые
    суммируются, и значение суммы. Предложите версии программы,
    использующие разные операторы цикла.*/
    public static void main(String[] args) {
        //TODO:Пока не понимаю смысла задания
    }
}

