package laba3;

import java.util.Scanner;

public class Example6 {
    /*Напишите программу, в которой создается одномерный числовой
    массив и заполняется числами, которые при делении на 5 дают в остатке 2
            (числа 2, 7,12,17 и так далее). Размер массива вводится пользователем.
    Предусмотреть обработку ошибки, связанной с вводом некорректного
    значения.*/
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        //TODO:остановился здесь
    }
}
